Revit 2026 API

# IFCHybridImportUpdateElements(Document, String) Method

---

**Note: This API is now obsolete.**

Updates IFC Elements using AnyCAD.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")]
public IList<ElementId> UpdateElements(
	Document doc,
	string file
)
```
```vb
<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")>
Public Function UpdateElements (
	doc As Document,
	file As String
) As IList(Of ElementId)
```
```cpp
public:
[ObsoleteAttribute(L"This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")]
IList<ElementId^>^ UpdateElements(
	Document^ doc,
	String^ file
)
```
```fsharp
[<ObsoleteAttribute("This is deprecated in Revit 2026.  Please use the updateElements function with the IFCHybridImportOptions.")>]
member UpdateElements :
        doc : Document *
        file : string -> IList<ElementId>
```

#### Parameters

doc Document
     Document to receive elements from the IFC file update.
file String
     Full path of the file to import.

#### Return Value

IListElementId Returns an array of ElementIds representing created or updated elements.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCHybridImport Class

UpdateElements Overload

Autodesk.Revit.DB.IFC Namespace